# Pandas in 10 mins

Online tutorial: http://pandas.pydata.org/pandas-docs/stable/10min.html#min

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Object Creation
Series creation

In [4]:
s = pd.Series([1,3,5,np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Data frame creation

In [5]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.664550 -1.208601  0.335745 -0.879810
2013-01-02 -0.728966 -0.489947 -0.420383  0.356450
2013-01-03 -1.256113  1.894253 -0.078973 -0.636573
2013-01-04 -1.305825  1.830385 -2.355346  0.757869
2013-01-05  2.708336  1.091260  1.386204 -0.507489
2013-01-06  0.233273 -0.603609 -0.129034  0.204936

In [8]:
df2 = pd.DataFrame({ 'A': 1.,
                      'B': pd.Timestamp('20130102'),
                      'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                      'D': np.array([3] * 4, dtype='int32'),
                      'E': pd.Categorical(['test', 'train', 'test', 'train']),
                      'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing Data
Display the head and tial of the data frame

In [10]:
df.head()

                   A         B         C         D
2013-01-01  1.664550 -1.208601  0.335745 -0.879810
2013-01-02 -0.728966 -0.489947 -0.420383  0.356450
2013-01-03 -1.256113  1.894253 -0.078973 -0.636573
2013-01-04 -1.305825  1.830385 -2.355346  0.757869
2013-01-05  2.708336  1.091260  1.386204 -0.507489

In [12]:
df.tail()

                   A         B         C         D
2013-01-02 -0.728966 -0.489947 -0.420383  0.356450
2013-01-03 -1.256113  1.894253 -0.078973 -0.636573
2013-01-04 -1.305825  1.830385 -2.355346  0.757869
2013-01-05  2.708336  1.091260  1.386204 -0.507489
2013-01-06  0.233273 -0.603609 -0.129034  0.204936

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.219209  0.418957 -0.210298 -0.117436
std    1.654467  1.352133  1.226067  0.647690
min   -1.305825 -1.208601 -2.355346 -0.879810
25%   -1.124326 -0.575194 -0.347546 -0.604302
50%   -0.247847  0.300657 -0.104003 -0.151277
75%    1.306731  1.645603  0.232066  0.318571
max    2.708336  1.894253  1.386204  0.757869

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.664550   -0.728966   -1.256113   -1.305825    2.708336    0.233273
B   -1.208601   -0.489947    1.894253    1.830385    1.091260   -0.603609
C    0.335745   -0.420383   -0.078973   -2.355346    1.386204   -0.129034
D   -0.879810    0.356450   -0.636573    0.757869   -0.507489    0.204936

In [15]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.879810  0.335745 -1.208601  1.664550
2013-01-02  0.356450 -0.420383 -0.489947 -0.728966
2013-01-03 -0.636573 -0.078973  1.894253 -1.256113
2013-01-04  0.757869 -2.355346  1.830385 -1.305825
2013-01-05 -0.507489  1.386204  1.091260  2.708336
2013-01-06  0.204936 -0.129034 -0.603609  0.233273

In [16]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  1.664550 -1.208601  0.335745 -0.879810
2013-01-06  0.233273 -0.603609 -0.129034  0.204936
2013-01-02 -0.728966 -0.489947 -0.420383  0.356450
2013-01-05  2.708336  1.091260  1.386204 -0.507489
2013-01-04 -1.305825  1.830385 -2.355346  0.757869
2013-01-03 -1.256113  1.894253 -0.078973 -0.636573

## Selecting Data
### Getting

In [17]:
df['A']

2013-01-01    1.664550
2013-01-02   -0.728966
2013-01-03   -1.256113
2013-01-04   -1.305825
2013-01-05    2.708336
2013-01-06    0.233273
Freq: D, Name: A, dtype: float64

In [18]:
df.A

2013-01-01    1.664550
2013-01-02   -0.728966
2013-01-03   -1.256113
2013-01-04   -1.305825
2013-01-05    2.708336
2013-01-06    0.233273
Freq: D, Name: A, dtype: float64

In [19]:
df[0:3]

                   A         B         C         D
2013-01-01  1.664550 -1.208601  0.335745 -0.879810
2013-01-02 -0.728966 -0.489947 -0.420383  0.356450
2013-01-03 -1.256113  1.894253 -0.078973 -0.636573

### Selction by Label

In [20]:
df.loc[dates[0]]

A    1.664550
B   -1.208601
C    0.335745
D   -0.879810
Name: 2013-01-01 00:00:00, dtype: float64

In [21]:
df.loc[:,['A', 'B']]

                   A         B
2013-01-01  1.664550 -1.208601
2013-01-02 -0.728966 -0.489947
2013-01-03 -1.256113  1.894253
2013-01-04 -1.305825  1.830385
2013-01-05  2.708336  1.091260
2013-01-06  0.233273 -0.603609

In [22]:
df.loc['20130102':'20130104',['A', 'B']]

                   A         B
2013-01-02 -0.728966 -0.489947
2013-01-03 -1.256113  1.894253
2013-01-04 -1.305825  1.830385

In [23]:
df.loc['20130102', ['A', 'B']]

A   -0.728966
B   -0.489947
Name: 2013-01-02 00:00:00, dtype: float64

In [24]:
df.loc[dates[0], 'A']

1.6645501177122948

In [25]:
df.at[dates[0], 'A']

1.6645501177122948

### Selection by position

In [26]:
df.iloc[3]

A   -1.305825
B    1.830385
C   -2.355346
D    0.757869
Name: 2013-01-04 00:00:00, dtype: float64

In [27]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.305825  1.830385
2013-01-05  2.708336  1.091260

In [28]:
df.iloc[[1,2,4], [0, 2]]

                   A         C
2013-01-02 -0.728966 -0.420383
2013-01-03 -1.256113 -0.078973
2013-01-05  2.708336  1.386204

In [29]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.728966 -0.489947 -0.420383  0.356450
2013-01-03 -1.256113  1.894253 -0.078973 -0.636573

In [30]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -1.208601  0.335745
2013-01-02 -0.489947 -0.420383
2013-01-03  1.894253 -0.078973
2013-01-04  1.830385 -2.355346
2013-01-05  1.091260  1.386204
2013-01-06 -0.603609 -0.129034

In [31]:
df.iloc[1,1]

-0.48994692875717383

In [32]:
df.iat[1,1]

-0.48994692875717383

### Boolean Indexing
Using a single colums values to select data

In [33]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  1.664550 -1.208601  0.335745 -0.879810
2013-01-05  2.708336  1.091260  1.386204 -0.507489
2013-01-06  0.233273 -0.603609 -0.129034  0.204936

In [34]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.664550       NaN  0.335745       NaN
2013-01-02       NaN       NaN       NaN  0.356450
2013-01-03       NaN  1.894253       NaN       NaN
2013-01-04       NaN  1.830385       NaN  0.757869
2013-01-05  2.708336  1.091260  1.386204       NaN
2013-01-06  0.233273       NaN       NaN  0.204936

In [37]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  1.664550 -1.208601  0.335745 -0.879810    one
2013-01-02 -0.728966 -0.489947 -0.420383  0.356450    one
2013-01-03 -1.256113  1.894253 -0.078973 -0.636573    two
2013-01-04 -1.305825  1.830385 -2.355346  0.757869  three
2013-01-05  2.708336  1.091260  1.386204 -0.507489   four
2013-01-06  0.233273 -0.603609 -0.129034  0.204936  three

In [38]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -1.256113  1.894253 -0.078973 -0.636573   two
2013-01-05  2.708336  1.091260  1.386204 -0.507489  four

### Setting

In [40]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [41]:
df['F'] = s1

In [42]:
df

                   A         B         C         D    F
2013-01-01  1.664550 -1.208601  0.335745 -0.879810  NaN
2013-01-02 -0.728966 -0.489947 -0.420383  0.356450  1.0
2013-01-03 -1.256113  1.894253 -0.078973 -0.636573  2.0
2013-01-04 -1.305825  1.830385 -2.355346  0.757869  3.0
2013-01-05  2.708336  1.091260  1.386204 -0.507489  4.0
2013-01-06  0.233273 -0.603609 -0.129034  0.204936  5.0

In [43]:
df.at[dates[0],'A']=0
df.iat[0,1] = 0
df.loc[:, 'D'] = np.array([5] * len(df))

In [45]:
df2 = df.copy()
df2[df2> 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.335745 -5  NaN
2013-01-02 -0.728966 -0.489947 -0.420383 -5 -1.0
2013-01-03 -1.256113 -1.894253 -0.078973 -5 -2.0
2013-01-04 -1.305825 -1.830385 -2.355346 -5 -3.0
2013-01-05 -2.708336 -1.091260 -1.386204 -5 -4.0
2013-01-06 -0.233273 -0.603609 -0.129034 -5 -5.0

## Missing Data

In [46]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.335745  5  NaN  1.0
2013-01-02 -0.728966 -0.489947 -0.420383  5  1.0  1.0
2013-01-03 -1.256113  1.894253 -0.078973  5  2.0  NaN
2013-01-04 -1.305825  1.830385 -2.355346  5  3.0  NaN

In [47]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -0.728966 -0.489947 -0.420383  5  1.0  1.0

In [48]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.335745  5  5.0  1.0
2013-01-02 -0.728966 -0.489947 -0.420383  5  1.0  1.0
2013-01-03 -1.256113  1.894253 -0.078973  5  2.0  5.0
2013-01-04 -1.305825  1.830385 -2.355346  5  3.0  5.0

In [49]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Operations
### Stats
Operations exclude missing data

In [52]:
df.mean()

A   -0.058216
B    0.620390
C   -0.210298
D    5.000000
F    3.000000
dtype: float64

Same operation on the other axis:

In [53]:
df.mean(1)

2013-01-01    1.333936
2013-01-02    0.872141
2013-01-03    1.511833
2013-01-04    1.233843
2013-01-05    2.837160
2013-01-06    1.900126
Freq: D, dtype: float64

In [54]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [55]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -2.256113  0.894253 -1.078973  4.0  1.0
2013-01-04 -4.305825 -1.169615 -5.355346  2.0  0.0
2013-01-05 -2.291664 -3.908740 -3.613796  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

### Apply
Apply Functions to the data

In [56]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.335745   5   NaN
2013-01-02 -0.728966 -0.489947 -0.084637  10   1.0
2013-01-03 -1.985079  1.404306 -0.163610  15   3.0
2013-01-04 -3.290904  3.234691 -2.518956  20   6.0
2013-01-05 -0.582568  4.325951 -1.132753  25  10.0
2013-01-06 -0.349295  3.722342 -1.261787  30  15.0

In [57]:
df.apply(lambda x:x.max() - x.min())

A    4.014161
B    2.497862
C    3.741550
D    0.000000
F    4.000000
dtype: float64

### Histogramming

In [58]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    4
1    6
2    6
3    6
4    6
5    3
6    5
7    4
8    1
9    0
dtype: int64

In [59]:
s.value_counts()

6    4
4    2
5    1
3    1
1    1
0    1
dtype: int64

### String Methods
Can use Series to process str

In [60]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge
### Concat

In [62]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.830243 -0.800382  0.862958  1.842959
1 -0.293520  1.935390  1.175230  1.017326
2 -0.628213 -0.091992  0.371536 -0.743961
3  0.802042 -1.339775 -0.476003  0.027179
4 -0.734313 -2.353382  0.381310  0.386061
5  0.285956  0.512702  0.905836 -0.758487
6  0.334186  1.083521 -0.090841  2.058589
7  0.680850  1.381403 -0.231423  0.722995
8  0.899239 -1.059064 -0.363913 -0.386227
9 -0.838396  0.154989  0.510246 -1.870793

In [65]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.830243 -0.800382  0.862958  1.842959
 1 -0.293520  1.935390  1.175230  1.017326
 2 -0.628213 -0.091992  0.371536 -0.743961,
           0         1         2         3
 3  0.802042 -1.339775 -0.476003  0.027179
 4 -0.734313 -2.353382  0.381310  0.386061
 5  0.285956  0.512702  0.905836 -0.758487
 6  0.334186  1.083521 -0.090841  2.058589,
           0         1         2         3
 7  0.680850  1.381403 -0.231423  0.722995
 8  0.899239 -1.059064 -0.363913 -0.386227
 9 -0.838396  0.154989  0.510246 -1.870793]

In [67]:
pd.concat(pieces)

          0         1         2         3
0 -0.830243 -0.800382  0.862958  1.842959
1 -0.293520  1.935390  1.175230  1.017326
2 -0.628213 -0.091992  0.371536 -0.743961
3  0.802042 -1.339775 -0.476003  0.027179
4 -0.734313 -2.353382  0.381310  0.386061
5  0.285956  0.512702  0.905836 -0.758487
6  0.334186  1.083521 -0.090841  2.058589
7  0.680850  1.381403 -0.231423  0.722995
8  0.899239 -1.059064 -0.363913 -0.386227
9 -0.838396  0.154989  0.510246 -1.870793

### Join

In [68]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  foo     2

In [69]:
right

   key  rval
0  foo     4
1  foo     5

In [70]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

### Append

In [71]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0  0.082732  0.992517  0.848693  1.318457
1  1.277531  2.222145  1.392510 -0.884517
2  0.220539 -0.808239 -0.792711  0.097098
3 -0.476097  0.607997  0.165547 -0.357524
4 -1.585795  0.580167  0.065536  0.434885
5  1.047313  1.559950 -1.885126  0.150536
6  1.170747 -0.016801  1.572325 -1.136381
7 -0.695888  1.039044 -0.477839 -2.174172

In [72]:
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0  0.082732  0.992517  0.848693  1.318457
1  1.277531  2.222145  1.392510 -0.884517
2  0.220539 -0.808239 -0.792711  0.097098
3 -0.476097  0.607997  0.165547 -0.357524
4 -1.585795  0.580167  0.065536  0.434885
5  1.047313  1.559950 -1.885126  0.150536
6  1.170747 -0.016801  1.572325 -1.136381
7 -0.695888  1.039044 -0.477839 -2.174172
8 -0.476097  0.607997  0.165547 -0.357524

## Grouping
This refers to either:
- Splitting the data into groups based on a criteria
- Applying a function to each group independently
- Combining the results into a data structure

In [74]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.094892 -0.633354
1  bar    one -0.050847  0.134357
2  foo    two -1.489407  0.354950
3  bar  three  0.019270  0.925175
4  foo    two -1.846393  1.034959
5  bar    two  0.922030  1.613479
6  foo    one  0.093396  0.793814
7  foo  three  1.452692  0.146738

In [75]:
df.groupby('A').sum()

            C         D
A
bar  0.890453  2.673011
foo -1.884603  1.697107

In [76]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.050847  0.134357
    three  0.019270  0.925175
    two    0.922030  1.613479
foo one   -0.001495  0.160460
    three  1.452692  0.146738
    two   -3.335799  1.389909

## Reshaping
### Stack

In [77]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                         'foo', 'foo', 'qux', 'qux'],
                        ['one', 'two', 'one', 'two',
                         'one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.416990 -0.698776
      two    -2.579561  0.379242
baz   one     0.538905  1.118662
      two     0.886787 -0.416074

In [78]:
stacked = df2.stack()
stacked

first  second
bar    one     A    0.416990
               B   -0.698776
       two     A   -2.579561
               B    0.379242
baz    one     A    0.538905
               B    1.118662
       two     A    0.886787
               B   -0.416074
dtype: float64

In [79]:
stacked.unstack()

                     A         B
first second
bar   one     0.416990 -0.698776
      two    -2.579561  0.379242
baz   one     0.538905  1.118662
      two     0.886787 -0.416074

In [81]:
stacked.unstack(1)

second        one       two
first
bar   A  0.416990 -2.579561
      B -0.698776  0.379242
baz   A  0.538905  0.886787
      B  1.118662 -0.416074

In [82]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.416990  0.538905
       B -0.698776  1.118662
two    A -2.579561  0.886787
       B  0.379242 -0.416074

### Pivot Tables

In [84]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                      'B' : ['A', 'B', 'C'] * 4,
                      'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                      'D' : np.random.randn(12),
                      'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -0.632608  1.631195
1     one  B  foo  0.397250 -1.664459
2     two  C  foo  0.131464 -0.666776
3   three  A  bar -0.942211 -1.292271
4     one  B  bar -0.834746 -0.045289
5     one  C  bar  0.692346 -0.552176
6     two  A  foo -2.262678 -1.031824
7   three  B  foo -2.516392  1.116081
8     one  C  foo  1.486045  0.377247
9     one  A  bar -0.051288  0.899399
10    two  B  bar -1.129508 -1.806614
11  three  C  bar  1.114382 -0.109422

In [85]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.051288 -0.632608
      B -0.834746  0.397250
      C  0.692346  1.486045
three A -0.942211       NaN
      B       NaN -2.516392
      C  1.114382       NaN
two   A       NaN -2.262678
      B -1.129508       NaN
      C       NaN  0.131464

## Time Series

In [86]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts.resample('5Min').sum()

2012-01-01    24037
Freq: 5T, dtype: int64